[Killed] BlockStatement
src/get.ts:10:72
 export function get(
   content: string,
   arg?: string | readonly string[],
-): EnvRecord | string | undefined | Record<string, string | undefined> {
-  const normalized = normalizeContent(content);
-  const lines = splitLines(normalized);
-
-  if (typeof arg === "undefined") {
-    const map = scanAll(lines);
-    return Object.fromEntries(map) as EnvRecord;
-  }
-
-  if (typeof arg === "string") {
-    return scanForSingle(lines, arg);
-  }
-
-  const normalizedTargets = Array.from(new Set(arg.map((name) => validateKey(name))));
-  const lookup = scanForMany(lines, new Set(normalizedTargets));
-
-  const ordered: [string, string | undefined][] = normalizedTargets.map((key) => [key, lookup.get(key)]);
-  return Object.fromEntries(ordered) as Record<string, string | undefined>;
-}
+): EnvRecord | string | undefined | Record<string, string | undefined> {}
 
 function scanAll(lines: string[]): Map<string, string> {
killedBy: All tests
statusReason: bun test v1.2.23 (cf136713)


src/__tests__/set.test.ts:

(pass) set > replaces only the last assignment for an existing variable [7.00ms]

(pass) set > appends variables that are not found

[Killed] ConditionalExpression
src/get.ts:14:7
   const normalized = normalizeContent(content);
   const lines = splitLines(normalized);
 
-  if (typeof arg === "undefined") {
+  if (false) {
     const map = scanAll(lines);
     return Object.fromEntries(map) as EnvRecord;
killedBy: All tests
statusReason: bun test v1.2.23 (cf136713)


src/__tests__/set.test.ts:

(pass) set > replaces only the last assignment for an existing variable [2.00ms]
(pass) set > appends variables that are not found

[Killed] ConditionalExpression
src/get.ts:14:7
   const normalized = normalizeContent(content);
   const lines = splitLines(normalized);
 
-  if (typeof arg === "undefined") {
+  if (true) {
     const map = scanAll(lines);
     return Object.fromEntries(map) as EnvRecord;
killedBy: All tests
statusReason: bun test v1.2.23 (cf136713)


src/__tests__/set.test.ts:

(pass) set > replaces only the last assignment for an existing variable [3.00ms]
(pass) set > appends variables that are not found
(pass) set > quotes values with spaces and preserves export prefix

[Killed] ConditionalExpression
src/get.ts:19:7
     return Object.fromEntries(map) as EnvRecord;
   }
 
-  if (typeof arg === "string") {
+  if (true) {
     return scanForSingle(lines, arg);
   }
killedBy: All tests
statusReason: bun test v1.2.23 (cf136713)


src/__tests__/set.test.ts:

(pass) set > replaces only the last assignment for an existing variable [2.00ms]

(pass) set > appends variables that are not found [1.00ms]

[Killed] BlockStatement
src/get.ts:19:32
     return Object.fromEntries(map) as EnvRecord;
   }
 
-  if (typeof arg === "string") {
-    return scanForSingle(lines, arg);
-  }
+  if (typeof arg === "string") {}
 
   const normalizedTargets = Array.from(new Set(arg.map((name) => validateKey(name))));
killedBy: All tests
statusReason: bun test v1.2.23 (cf136713)


src/__tests__/set.test.ts:

(pass) set > replaces only the last assignment for an existing variable [3.00ms]

(pass) set > appends variables that are not found

[Killed] ArrowFunction
src/get.ts:23:56
     return scanForSingle(lines, arg);
   }
 
-  const normalizedTargets = Array.from(new Set(arg.map((name) => validateKey(name))));
+  const normalizedTargets = Array.from(new Set(arg.map(() => undefined)));
   const lookup = scanForMany(lines, new Set(normalizedTargets));
 
killedBy: All tests
statusReason: bun test v1.2.23 (cf136713)


src/__tests__/set.test.ts:

(pass) set > replaces only the last assignment for an existing variable [4.00ms]

(pass) set > appends variables that are not found

[Killed] ArrowFunction
src/get.ts:26:73
   const normalizedTargets = Array.from(new Set(arg.map((name) => validateKey(name))));
   const lookup = scanForMany(lines, new Set(normalizedTargets));
 
-  const ordered: [string, string | undefined][] = normalizedTargets.map((key) => [key, lookup.get(key)]);
+  const ordered: [string, string | undefined][] = normalizedTargets.map(() => undefined);
   return Object.fromEntries(ordered) as Record<string, string | undefined>;
 }
killedBy: All tests
statusReason: bun test v1.2.23 (cf136713)


src/__tests__/set.test.ts:

(pass) set > replaces only the last assignment for an existing variable [6.00ms]
(pass) set > appends variables that are not found
(pass) set > quotes values with spaces and preserves export prefix [1.00ms]

[Killed] ArrayDeclaration
src/get.ts:26:82
   const normalizedTargets = Array.from(new Set(arg.map((name) => validateKey(name))));
   const lookup = scanForMany(lines, new Set(normalizedTargets));
 
-  const ordered: [string, string | undefined][] = normalizedTargets.map((key) => [key, lookup.get(key)]);
+  const ordered: [string, string | undefined][] = normalizedTargets.map((key) => []);
   return Object.fromEntries(ordered) as Record<string, string | undefined>;
 }
killedBy: All tests
statusReason: bun test v1.2.23 (cf136713)


src/__tests__/set.test.ts:

(pass) set > replaces only the last assignment for an existing variable [2.00ms]

(pass) set > appends variables that are not found

[Killed] BlockStatement
src/get.ts:30:56
   return Object.fromEntries(ordered) as Record<string, string | undefined>;
 }
 
-function scanAll(lines: string[]): Map<string, string> {
-  const result = new Map<string, string>();
-  iterateAssignments(lines, (assignment) => {
-    if (!result.has(assignment.key)) {
-      result.set(assignment.key, assignment.value);
-    }
-  });
-  return result;
-}
+function scanAll(lines: string[]): Map<string, string> {}
 
 function scanForSingle(lines: string[], target: string): string | undefined {
killedBy: All tests
statusReason: bun test v1.2.23 (cf136713)


src/__tests__/set.test.ts:

(pass) set > replaces only the last assignment for an existing variable [2.00ms]

(pass) set > appends variables that are not found [1.00ms]

[Killed] BlockStatement
src/get.ts:32:45
 
 function scanAll(lines: string[]): Map<string, string> {
   const result = new Map<string, string>();
-  iterateAssignments(lines, (assignment) => {
-    if (!result.has(assignment.key)) {
-      result.set(assignment.key, assignment.value);
-    }
-  });
+  iterateAssignments(lines, (assignment) => {});
   return result;
 }
killedBy: All tests
statusReason: bun test v1.2.23 (cf136713)


src/__tests__/set.test.ts:

(pass) set > replaces only the last assignment for an existing variable [2.00ms]

(pass) set > appends variables that are not found

[Killed] BooleanLiteral
src/get.ts:33:9
 function scanAll(lines: string[]): Map<string, string> {
   const result = new Map<string, string>();
   iterateAssignments(lines, (assignment) => {
-    if (!result.has(assignment.key)) {
+    if (result.has(assignment.key)) {
       result.set(assignment.key, assignment.value);
     }
killedBy: All tests
statusReason: bun test v1.2.23 (cf136713)


src/__tests__/set.test.ts:

(pass) set > replaces only the last assignment for an existing variable [2.00ms]

(pass) set > appends variables that are not found

[Killed] BlockStatement
src/get.ts:33:38
 function scanAll(lines: string[]): Map<string, string> {
   const result = new Map<string, string>();
   iterateAssignments(lines, (assignment) => {
-    if (!result.has(assignment.key)) {
-      result.set(assignment.key, assignment.value);
-    }
+    if (!result.has(assignment.key)) {}
   });
   return result;
killedBy: All tests
statusReason: bun test v1.2.23 (cf136713)


src/__tests__/set.test.ts:

(pass) set > replaces only the last assignment for an existing variable [10.00ms]

(pass) set > appends variables that are not found

[Killed] BlockStatement
src/get.ts:40:77
   return result;
 }
 
-function scanForSingle(lines: string[], target: string): string | undefined {
-  const name = validateKey(target);
-  let found: string | undefined;
-  iterateAssignments(lines, (assignment) => {
-    if (assignment.key === name) {
-      found = assignment.value;
-      return true;
-    }
-    return undefined;
-  });
-  return found;
-}
+function scanForSingle(lines: string[], target: string): string | undefined {}
 
 function scanForMany(lines: string[], targets: Set<string>): Map<string, string> {
killedBy: All tests
statusReason: bun test v1.2.23 (cf136713)


src/__tests__/set.test.ts:

(pass) set > replaces only the last assignment for an existing variable [2.00ms]

(pass) set > appends variables that are not found

[Killed] BlockStatement
src/get.ts:43:45
 function scanForSingle(lines: string[], target: string): string | undefined {
   const name = validateKey(target);
   let found: string | undefined;
-  iterateAssignments(lines, (assignment) => {
-    if (assignment.key === name) {
-      found = assignment.value;
-      return true;
-    }
-    return undefined;
-  });
+  iterateAssignments(lines, (assignment) => {});
   return found;
 }
killedBy: All tests
statusReason: bun test v1.2.23 (cf136713)


src/__tests__/set.test.ts:

(pass) set > replaces only the last assignment for an existing variable [2.00ms]

(pass) set > appends variables that are not found [1.00ms]

[Killed] EqualityOperator
src/get.ts:44:9
   const name = validateKey(target);
   let found: string | undefined;
   iterateAssignments(lines, (assignment) => {
-    if (assignment.key === name) {
+    if (assignment.key !== name) {
       found = assignment.value;
       return true;
killedBy: All tests
statusReason: bun test v1.2.23 (cf136713)


src/__tests__/set.test.ts:

(pass) set > replaces only the last assignment for an existing variable [2.00ms]

(pass) set > appends variables that are not found

[Killed] ConditionalExpression
src/get.ts:44:9
   const name = validateKey(target);
   let found: string | undefined;
   iterateAssignments(lines, (assignment) => {
-    if (assignment.key === name) {
+    if (false) {
       found = assignment.value;
       return true;
killedBy: All tests
statusReason: bun test v1.2.23 (cf136713)


src/__tests__/set.test.ts:

(pass) set > replaces only the last assignment for an existing variable [2.00ms]

(pass) set > appends variables that are not found

[Survived] BooleanLiteral
src/get.ts:46:14
   iterateAssignments(lines, (assignment) => {
     if (assignment.key === name) {
       found = assignment.value;
-      return true;
+      return false;
     }
     return undefined;

[Killed] BlockStatement
src/get.ts:53:82
   return found;
 }
 
-function scanForMany(lines: string[], targets: Set<string>): Map<string, string> {
-  const normalizedTargets = new Set<string>();
-  for (const target of targets) {
-    normalizedTargets.add(validateKey(target));
-  }
-
-  const found = new Map<string, string>();
-  const remaining = new Set(normalizedTargets);
-
-  iterateAssignments(lines, (assignment) => {
-    if (!remaining.has(assignment.key) || found.has(assignment.key)) {
-      return;
-    }
-
-    found.set(assignment.key, assignment.value);
-    remaining.delete(assignment.key);
-
-    if (remaining.size === 0) {
-      return true;
-    }
-    return undefined;
-  });
-
-  return found;
-}
+function scanForMany(lines: string[], targets: Set<string>): Map<string, string> {}
 
 function iterateAssignments(
killedBy: All tests
statusReason: bun test v1.2.23 (cf136713)


src/__tests__/set.test.ts:

(pass) set > replaces only the last assignment for an existing variable [2.00ms]

(pass) set > appends variables that are not found

[Killed] BlockStatement
src/get.ts:55:33
 
 function scanForMany(lines: string[], targets: Set<string>): Map<string, string> {
   const normalizedTargets = new Set<string>();
-  for (const target of targets) {
-    normalizedTargets.add(validateKey(target));
-  }
+  for (const target of targets) {}
 
   const found = new Map<string, string>();
killedBy: All tests
statusReason: bun test v1.2.23 (cf136713)


src/__tests__/set.test.ts:

(pass) set > replaces only the last assignment for an existing variable [2.00ms]

(pass) set > appends variables that are not found

[Killed] BlockStatement
src/get.ts:62:45
   const found = new Map<string, string>();
   const remaining = new Set(normalizedTargets);
 
-  iterateAssignments(lines, (assignment) => {
-    if (!remaining.has(assignment.key) || found.has(assignment.key)) {
-      return;
-    }
-
-    found.set(assignment.key, assignment.value);
-    remaining.delete(assignment.key);
-
-    if (remaining.size === 0) {
-      return true;
-    }
-    return undefined;
-  });
+  iterateAssignments(lines, (assignment) => {});
 
   return found;
killedBy: All tests
statusReason: bun test v1.2.23 (cf136713)


src/__tests__/set.test.ts:

(pass) set > replaces only the last assignment for an existing variable [5.00ms]

(pass) set > appends variables that are not found

[Killed] BooleanLiteral
src/get.ts:63:9
   const remaining = new Set(normalizedTargets);
 
   iterateAssignments(lines, (assignment) => {
-    if (!remaining.has(assignment.key) || found.has(assignment.key)) {
+    if (remaining.has(assignment.key) || found.has(assignment.key)) {
       return;
     }
killedBy: All tests
statusReason: bun test v1.2.23 (cf136713)


src/__tests__/set.test.ts:

(pass) set > replaces only the last assignment for an existing variable [2.00ms]
(pass) set > appends variables that are not found
(pass) set > quotes values with spaces and preserves export prefix

[Killed] ConditionalExpression
src/get.ts:63:9
   const remaining = new Set(normalizedTargets);
 
   iterateAssignments(lines, (assignment) => {
-    if (!remaining.has(assignment.key) || found.has(assignment.key)) {
+    if (true) {
       return;
     }
killedBy: All tests
statusReason: bun test v1.2.23 (cf136713)


src/__tests__/set.test.ts:

(pass) set > replaces only the last assignment for an existing variable [1.00ms]

(pass) set > appends variables that are not found

[Killed] EqualityOperator
src/get.ts:70:9
     found.set(assignment.key, assignment.value);
     remaining.delete(assignment.key);
 
-    if (remaining.size === 0) {
+    if (remaining.size !== 0) {
       return true;
     }
killedBy: All tests
statusReason: bun test v1.2.23 (cf136713)


src/__tests__/set.test.ts:

(pass) set > replaces only the last assignment for an existing variable [2.00ms]

(pass) set > appends variables that are not found

[Killed] ConditionalExpression
src/get.ts:70:9
     found.set(assignment.key, assignment.value);
     remaining.delete(assignment.key);
 
-    if (remaining.size === 0) {
+    if (true) {
       return true;
     }
killedBy: All tests
statusReason: bun test v1.2.23 (cf136713)


src/__tests__/set.test.ts:

(pass) set > replaces only the last assignment for an existing variable [2.00ms]

(pass) set > appends variables that are not found

[Survived] BooleanLiteral
src/get.ts:71:14
     remaining.delete(assignment.key);
 
     if (remaining.size === 0) {
-      return true;
+      return false;
     }
     return undefined;

[Killed] BlockStatement
src/get.ts:82:9
 function iterateAssignments(
   lines: string[],
   callback: (assignment: ParsedAssignment) => boolean | void | undefined,
-): void {
-  for (let i = lines.length - 1; i >= 0; ) {
-    const parsed = parseAssignmentEndingAt(lines, i);
-    if (!parsed) {
-      i -= 1;
-      continue;
-    }
-
-    const shouldStop = callback(parsed);
-    if (shouldStop === true) {
-      return;
-    }
-
-    i = parsed.startIndex - 1;
-  }
-}
+): void {}
 
killedBy: All tests
statusReason: bun test v1.2.23 (cf136713)


src/__tests__/set.test.ts:

(pass) set > replaces only the last assignment for an existing variable [2.00ms]

(pass) set > appends variables that are not found

[Killed] EqualityOperator
src/get.ts:83:34
   lines: string[],
   callback: (assignment: ParsedAssignment) => boolean | void | undefined,
 ): void {
-  for (let i = lines.length - 1; i >= 0; ) {
+  for (let i = lines.length - 1; i < 0; ) {
     const parsed = parseAssignmentEndingAt(lines, i);
     if (!parsed) {
killedBy: All tests
statusReason: bun test v1.2.23 (cf136713)


src/__tests__/set.test.ts:

(pass) set > replaces only the last assignment for an existing variable [1.00ms]

(pass) set > appends variables that are not found

[Killed] ConditionalExpression
src/get.ts:83:34
   lines: string[],
   callback: (assignment: ParsedAssignment) => boolean | void | undefined,
 ): void {
-  for (let i = lines.length - 1; i >= 0; ) {
+  for (let i = lines.length - 1; false; ) {
     const parsed = parseAssignmentEndingAt(lines, i);
     if (!parsed) {
killedBy: All tests
statusReason: bun test v1.2.23 (cf136713)


src/__tests__/set.test.ts:

(pass) set > replaces only the last assignment for an existing variable [2.00ms]

(pass) set > appends variables that are not found

[Killed] ConditionalExpression
src/get.ts:85:9
 ): void {
   for (let i = lines.length - 1; i >= 0; ) {
     const parsed = parseAssignmentEndingAt(lines, i);
-    if (!parsed) {
+    if (true) {
       i -= 1;
       continue;
killedBy: All tests
statusReason: bun test v1.2.23 (cf136713)


src/__tests__/set.test.ts:

(pass) set > replaces only the last assignment for an existing variable [2.00ms]

(pass) set > appends variables that are not found [1.00ms]

[Killed] BlockStatement
src/get.ts:85:18
 ): void {
   for (let i = lines.length - 1; i >= 0; ) {
     const parsed = parseAssignmentEndingAt(lines, i);
-    if (!parsed) {
-      i -= 1;
-      continue;
-    }
+    if (!parsed) {}
 
     const shouldStop = callback(parsed);
killedBy: All tests
statusReason: bun test v1.2.23 (cf136713)


src/__tests__/set.test.ts:

(pass) set > replaces only the last assignment for an existing variable [2.00ms]

(pass) set > appends variables that are not found

[Timeout] AssignmentOperator
src/get.ts:86:7
   for (let i = lines.length - 1; i >= 0; ) {
     const parsed = parseAssignmentEndingAt(lines, i);
     if (!parsed) {
-      i -= 1;
+      i += 1;
       continue;
     }

[Killed] EqualityOperator
src/get.ts:91:9
     }
 
     const shouldStop = callback(parsed);
-    if (shouldStop === true) {
+    if (shouldStop !== true) {
       return;
     }
killedBy: All tests
statusReason: bun test v1.2.23 (cf136713)


src/__tests__/set.test.ts:

(pass) set > replaces only the last assignment for an existing variable [1.00ms]

(pass) set > appends variables that are not found [1.00ms]

[Killed] ConditionalExpression
src/get.ts:91:9
     }
 
     const shouldStop = callback(parsed);
-    if (shouldStop === true) {
+    if (true) {
       return;
     }
killedBy: All tests
statusReason: bun test v1.2.23 (cf136713)


src/__tests__/set.test.ts:

(pass) set > replaces only the last assignment for an existing variable [1.00ms]

(pass) set > appends variables that are not found [1.00ms]

[Timeout] ArithmeticOperator
src/get.ts:95:9
       return;
     }
 
-    i = parsed.startIndex - 1;
+    i = parsed.startIndex + 1;
   }
 }
